pok3r-custom/pok3r_re_firmware/vendor/holtek/HT32_STD_1xxxx_FWLib_v003_1679/example/I2C/EEPROM/main.c
/*********************************************************************************************************//**
 * @file    I2C/EEPROM/main.c
 * @version $Rev:: 427          $
 * @date    $Date:: 2017-07-04 #$
 * @brief   Main program.
 *************************************************************************************************************
 * @attention
 *
 * Firmware Disclaimer Information
 *
 * 1. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, which is supplied by Holtek Semiconductor Inc., (hereinafter referred to as "HOLTEK") is the
 *    proprietary and confidential intellectual property of HOLTEK, and is protected by copyright law and
 *    other intellectual property laws.
 *
 * 2. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, is confidential information belonging to HOLTEK, and must not be disclosed to any third parties
 *    other than HOLTEK and the customer.
 *
 * 3. The program technical documentation, including the code, is provided "as is" and for customer reference
 *    only. After delivery by HOLTEK, the customer shall use the program technical documentation, including
 *    the code, at their own risk. HOLTEK disclaims any expressed, implied or statutory warranties, including
 *    the warranties of merchantability, satisfactory quality and fitness for a particular purpose.
 *
 * <h2><center>Copyright (C) Holtek Semiconductor Inc. All rights reserved</center></h2>
 ************************************************************************************************************/

/* Includes ------------------------------------------------------------------------------------------------*/
#include <stdlib.h>
#include <string.h>
#include "ht32.h"
#include "ht32_board.h"

/** @addtogroup HT32_Series_Peripheral_Examples HT32 Peripheral Examples
  * @{
  */

/** @addtogroup I2C_Examples I2C
  * @{
  */

/** @addtogroup EEPROM
  * @{
  */


/* Private constants ---------------------------------------------------------------------------------------*/
#define WRITE_BUF_ADDR    (0x20000600)
#define READ_BUF_ADDR     (0x20000700)
#define EEPROM_PAGE_CNT   (I2C_EEPROM_CAPACITY / I2C_EEPROM_PAGE_SIZE)

/* Global functions ----------------------------------------------------------------------------------------*/
/*********************************************************************************************************//**
  * @brief  Main program.
  * @retval None
  ***********************************************************************************************************/
int main(void)
{
  u32 i, j, *pBuf;

  RETARGET_Configuration();           /* Retarget Related configuration                                     */

  /* print message                                                                                          */
  printf("\r\n*** HT32 I2C Example Code ***");
  printf("\r\n24LC02 EEPROM verifying : ");

  /* init EEPROM                                                                                            */
  I2C_EEPROM_Init();

  /* generate test pattern                                                                                  */
  for (j = 0; j < EEPROM_PAGE_CNT; j++)
  {
    pBuf =  (u32 *)WRITE_BUF_ADDR;

    for (i = 0; i < (I2C_EEPROM_PAGE_SIZE / 4); i++)
    {
      *pBuf++ = rand();
    }

    memset((u8 *)READ_BUF_ADDR, 0xC3, I2C_EEPROM_PAGE_SIZE);
    I2C_EEPROM_BufferWrite((u8 *)WRITE_BUF_ADDR, I2C_EEPROM_PAGE_SIZE * j, I2C_EEPROM_PAGE_SIZE);
    I2C_EEPROM_BufferRead((u8 *)READ_BUF_ADDR, I2C_EEPROM_PAGE_SIZE * j, I2C_EEPROM_PAGE_SIZE);

    if (memcmp((u8 *)WRITE_BUF_ADDR, (u8 *)READ_BUF_ADDR, I2C_EEPROM_PAGE_SIZE) != 0)
    {
      printf(" [Failed]\n");
      while (1);
    }

    printf("\r\t\t\t\t%d%%", (int)((j + 1) * 100)/EEPROM_PAGE_CNT);
  }

  printf(" [Pass]\n");
  while (1);
}

#if (HT32_LIB_DEBUG == 1)
/*********************************************************************************************************//**
  * @brief  Report both the error name of the source file and the source line number.
  * @param  filename: pointer to the source file name.
  * @param  uline: error line source number.
  * @retval None
  ***********************************************************************************************************/
void assert_error(u8* filename, u32 uline)
{
  /*
     This function is called by IP library that the invalid parameters has been passed to the library API.
     Debug message can be added here.
     Example: printf("Parameter Error: file %s on line %d\r\n", filename, uline);
  */

  while (1)
  {
  }
}
#endif


/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
